# -*- mode: ruby -*-
# vi: set ft=ruby :

tap 'robotlocomotion/director'

cask 'adoptopenjdk' unless system '/usr/libexec/java_home --version 1.8+ --failfast &> /dev/null'

brew 'clp'
brew 'cmake'
brew 'double-conversion'
brew 'eigen'
brew 'gcc'
brew 'fmt'
brew 'gflags'
brew 'glew'
brew 'glib'
brew 'graphviz'
brew 'ipopt'
brew 'libyaml'
brew 'lz4'
brew 'nlopt'
brew 'numpy'
brew 'msgpack-cxx'
brew 'openblas'
brew 'pkg-config'
brew 'python@3.9'
brew 'python-tk@3.9'
brew 'scipy'
brew 'spdlog'
brew 'suite-sparse'
brew 'tinyxml'
brew 'tinyxml2'
brew 'robotlocomotion/director/vtk@8.2.0'
brew 'xz'
brew 'yaml-cpp'
brew 'zeromq'

mas 'Xcode', id: 497799835 unless File.exist? '/Applications/Xcode.app'
